Revit 2024 API
View3D.RestoreOrientationAndLock Method
 Locks the view and restores its orientation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public void RestoreOrientationAndLock()
Visual Basic
Public Sub RestoreOrientationAndLock
Visual C++
public:
void RestoreOrientationAndLock()
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  View has never been locked.
See Also
View3D Class
Autodesk.Revit.DB Namespace